       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-MESSAGE        PIC X(20) VALUE SPACES.
       01 WS-COUNTER        PIC 9(3)  VALUE ZEROS.

       PROCEDURE DIVISION.
           MOVE "HELLO, WORLD!" TO WS-MESSAGE
           ADD 1 TO WS-COUNTER
           DISPLAY WS-MESSAGE
           STOP RUN.
